---
kind: property
id: P:Autodesk.Revit.DB.Element.AssemblyInstanceId
zh: 构件、图元、元素
source: html/83989f69-1aca-1a49-9647-e57bc2d58b21.htm
---
# Autodesk.Revit.DB.Element.AssemblyInstanceId Property

**中文**: 构件、图元、元素

The id of the assembly instance to which the element belongs.

## Syntax (C#)
```csharp
public ElementId AssemblyInstanceId { get; }
```